Schema description

In [1]:
import sqlite3
import pandas as pd

In [2]:
# Create in-memory SQLite database
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

# Create tables and insert sample data
cursor.executescript("""
CREATE TABLE video_views (
  viewer_id INT,
  video_id INT,
  view_time INT
);

CREATE TABLE videos (
  video_id INT,
  category TEXT
);

INSERT INTO video_views VALUES
(1, 101, 120),
(2, 101, 150),
(3, 102, 300),
(4, 103, 200),
(5, 104, 50),
(6, 102, 250),
(7, 104, 80),
(8, 105, 100);

INSERT INTO videos VALUES
(101, 'Music'),
(102, 'Education'),
(103, 'Gaming'),
(104, 'Music'),
(105, 'News');
""")

Visualizing Tables

In [8]:
query1 = """
select * from video_views
"""
query2 = """
select * from videos
"""
res1 = pd.read_sql_query(query1, conn)
res2 = pd.read_sql_query(query2, conn)
res1

   viewer_id  video_id  view_time
0          1       101        120
1          2       101        150
2          3       102        300
3          4       103        200
4          5       104         50
5          6       102        250
6          7       104         80
7          8       105        100

In [9]:
res2

   video_id   category
0       101      Music
1       102  Education
2       103     Gaming
3       104      Music
4       105       News

Problem Statement :
Return the top 3 categories by total view time (summed across all viewers).

SOLUTION

In [12]:
query = """
select v.category, sum(vv.view_time) as Total_View_Time
from video_views vv
join videos v on v.video_id = vv.video_id
group by category
order by Total_View_Time desc
limit 3;
"""

res = pd.read_sql_query(query, conn)
res

    category  Total_View_Time
0  Education              550
1      Music              400
2     Gaming              200